import { ContentContainer, Image } from "@/components";

import img8 from "./images/8.png";
import img9 from "./images/9.png";

export function Content5() {
    return (
        <ContentContainer>
            <h2 id="-https-uk-javascript-info-structure-semicolon-">
                Крапка з комою
            </h2>
            <p>
                Здебільшого крапку з комою можна пропустити, якщо є перенесення
                на новий рядок.
            </p>
            <p>Такий код буде працювати:</p>
            <Image src={img8} alt="image info" />

            <p>
                У цьому разі JavaScript інтерпретує перенесення рядка як
                &quot;неявну&quot; крапку з комою. Це називається автоматичне
                вставлення крапки з комою .
            </p>
            <p>
                <strong>
                    Переважно новий рядок означає крапку з комою. Але
                    &quot;переважно&quot; не означає &quot;завжди&quot;!
                </strong>
            </p>
            <p>
                У деяких випадках новий рядок не означає крапку з комою.
                Наприклад:
            </p>
            <Image src={img9} alt="image info" />
            <p>
                Код виведе <code>6</code>, тому що JavaScript не вставить тут
                крапку з комою. Інтуїтивно зрозуміло, що, якщо рядок
                закінчується плюсом <code>&quot;+&quot;</code>, то це
                &quot;незакінчений вираз&quot;, тому крапка з комою не потрібна.
                І в цьому випадку все працює як задумано.
            </p>
            <p>
                <strong>
                    Але є ситуації, коли JavaScript &quot;забуває&quot; вставити
                    крапку з комою там, де це дійсно потрібно.
                </strong>
            </p>
            <p>
                Помилки, які виникають у таких ситуаціях, досить важко виявити й
                виправити.
            </p>
            <p>
                Ми рекомендуємо ставити крапку з комою між інструкціями, навіть
                якщо вони розділені новими рядками. Це правило широко
                використовується в спільноті розробників. Варто повторити ще раз
                – здебільшого можна пропускати крапки з комою. Але безпечніше –
                особливо для новачка – використовувати їх.
            </p>
        </ContentContainer>
    );
}
