import { ContentContainer, Image } from "@/components";

import img13 from "./images/13.png";

export function Content7() {
    return (
        <ContentContainer>
            <h1 id="-use-strict-">Сучасний режим, &quot;use strict&quot;</h1>
            <p>
                Впродовж тривалого часу JavaScript розвивався без проблем із
                сумісністю. До мови додавалися нові функції, а стара
                функціональність залишалася незмінною.
            </p>
            <p>
                Перевагою цього було те, що існуючий код не ламався. Проте,
                будь-яка помилка або неідеальне рішення назавжди ставали
                частиною JavaScript, тому що цей код не змінювався.
            </p>
            <p>
                Так було до 2009 року, коли з&#39;явився стандарт ECMAScript 5
                (ES5). Він додав нові функції до мови і змінив деякі існуючі.
                Щоб старий код лишався робочим, більшість таких модифікацій
                усталено було вимкнено. Щоб увімкнути цей функціонал, потрібно
                прописати спеціальну директиву:{" "}
                <code>&quot;use strict&quot;</code>.
            </p>
            <h2 id="-use-strict-https-uk-javascript-info-strict-mode-use-strict-">
                <a href="https://uk.javascript.info/strict-mode#use-strict">
                    &quot;use strict&quot;
                </a>
            </h2>
            <p>
                Директива виглядає як рядок: <code>&quot;use strict&quot;</code>{" "}
                чи <code>&#39;use strict&#39;</code> і дослівно перекладається
                як &quot;використовувати суворий (режим)&quot;. Якщо вона
                прописана на початку скрипта, він буде виконуватися у
                &quot;сучасному&quot; режимі.
            </p>
            <p>Наприклад:</p>
            <Image src={img13} alt="image info" />

            <p>
                Незабаром ми будемо вивчати функції (такий собі спосіб
                групування команд). Забігаючи наперед, маймо на увазі, що{" "}
                <code>&quot;use strict&quot;</code> можна писати на початку
                функції. Таким чином, суворий режим буде використовуватися лише
                в межах цієї функції. Проте зазвичай люди використовують цей
                режим для всього скрипта.
            </p>
        </ContentContainer>
    );
}
