import { ContentContainer, Image } from "@/components";

import img1 from "./images/1.png";

export function ContentOne() {
    return (
        <ContentContainer>
            <h1 id="-">Привіт, світ!</h1>
            <p>
                Ця частина посібника розповідає про основи JavaScript, про саму
                мову.
            </p>
            <p>
                Але нам необхідне робоче середовище для запуску наших скриптів
                і, оскільки ця книга є онлайн, браузер є гарним вибором для
                цього. Ми зведемо до мінімуму кількість специфічних команд для
                браузера (наприклад <code>alert</code>), щоб ви не витрачали час
                на них, якщо плануєте зосередитися на іншому середовищі (як
                Node.js). Ми зосередимось на JavaScript в браузері.
            </p>
            <p>
                Насамперед, давайте подивимось, як додавати скрипти до сторінки.
                Для серверних середовищ (як Node.js) ви можете виконати скрипти
                за допомогою команди <code>&quot;node my.js&quot;</code>.
            </p>
            <h2 id="-script-">Тег &quot;script&quot;</h2>
            <p>
                Програми JavaScript можна вставити у будь-яку частину HTML
                документа, використовуючи тег <code>&lt;script&gt;</code>.
            </p>
            <p>Наприклад:</p>
            <Image src={img1} alt="image info"  />
            <p>
                Ви можете запустити приклад, натиснувши на кнопку “Показати” у
                правому верхньому куті поля вище. Тег <code>{"<script>"}</code>{" "}
                містить код JavaScript, який автоматично виконується, коли
                браузер обробляє тег.
            </p>
        </ContentContainer>
    );
}
